In [1]:
import numpy as np
import pandas as pd

titanic = '../data/titanic/raw/train.csv'
titanic_data_raw = pd.read_csv(titanic)

In [2]:
titanic_data_raw.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
drop_cols = ['PassengerId', 'Name', 'Ticket', 'Cabin', 'Embarked']
titanic_data = titanic_data_raw.drop(drop_cols, axis=1)

In [4]:
sex_dict = {'male': 0, 'female': 1}
titanic_data = titanic_data.replace({'Sex': sex_dict})

In [5]:
titanic_data = titanic_data.fillna(titanic_data.median())

In [6]:
features, label = titanic_data.drop(['Survived'], axis=1), titanic_data['Survived']

In [7]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(features, label, test_size=0.3, random_state=1113)

In [8]:
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import roc_auc_score

clf = RandomForestClassifier(n_estimators=128, max_depth=3)
clf.fit(X_train, y_train)
y_pred = clf.predict_proba(X_test)
print(roc_auc_score(y_test, y_pred[:, 1]))

0.836631944444

In [9]:
X_train.head()

     Pclass  Sex   Age  SibSp  Parch     Fare
200       3    0  28.0      0      0   9.5000
251       3    1  29.0      1      1  10.4625
42        3    0  28.0      0      0   7.8958
635       2    1  28.0      0      0  13.0000
329       1    1  16.0      0      1  57.9792

In [10]:
X_train.Sex.value_counts()

0    404
1    219
Name: Sex, dtype: int64

In [11]:
from binning import Binner

binner = Binner()

binner.fit(X_train)
binned = binner.transform(X_trained)

8
[(71.0, 45.0), (45.0, 37.0), (37.0, 32.5), (32.5, 27.0), (27.0, 23.5), (23.5, 18.0), (18.0, 4.0), (4.0, -0.32999999999999996)]
9
[(512.32920000000001, 76.291700000000006), (76.291700000000006, 39.0), (39.0, 26.387499999999999), (26.387499999999999, 19.5), (19.5, 12.875), (12.875, 8.4582999999999995), (8.4582999999999995, 7.8875000000000002), (7.8875000000000002, 7.5208000000000004), (7.5208000000000004, -1.0)]

In [12]:
binned.head()

   Age_binned  Fare_binned
0           3            5
1           3            5
2           3            6
3           3            4
4           6            1